<a href="https://colab.research.google.com/github/Young-Dong/python/blob/master/nlp100_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**第2章: UNIXコマンド**<br>
[popular-names.txt](https://nlp100.github.io/data/popular-names.txt)は，アメリカで生まれた赤ちゃんの「名前」「性別」「人数」「年」をタブ区切り形式で格納したファイルである．以下の処理を行うプログラムを作成し，popular-names.txtを入力ファイルとして実行せよ．さらに，同様の処理をUNIXコマンドでも実行し，プログラムの実行結果を確認せよ．

10. 行数のカウント<br>
行数をカウントせよ．確認にはwcコマンドを用いよ．

In [ ]:
import pandas as pd
url = 'https://nlp100.github.io/data/popular-names.txt'
df = pd.read_csv(url, header=None)
print(df.shape[0])

2780

In [ ]:
df.head()

                          0
0       Mary\tF\t7065\t1880
1       Anna\tF\t2604\t1880
2       Emma\tF\t2003\t1880
3  Elizabeth\tF\t1939\t1880
4     Minnie\tF\t1746\t1880

11. タブをスペースに置換<br>
タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [ ]:
df[0] = [i.replace('\t',' ') for i in df[0]]
df.head()

                       0
0       Mary F 7065 1880
1       Anna F 2604 1880
2       Emma F 2003 1880
3  Elizabeth F 1939 1880
4     Minnie F 1746 1880

12. 1列目をcol1.txtに，2列目をcol2.txtに保存<br>
各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [ ]:
df = pd.read_csv(url, sep='\t', header=None)
df[0].to_csv('col1.txt', index=False)
df[1].to_csv('col2.txt', index=False)
df[1].head()

0    F
1    F
2    F
3    F
4    F
Name: 1, dtype: object

13. col1.txtとcol2.txtをマージ<br>
12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [ ]:
df1 = pd.read_csv('col1.txt')
df2 = pd.read_csv('col2.txt')
df0 = pd.concat([df1, df2], axis=1)
df0.head()

           0  1
0       Mary  F
1       Anna  F
2       Emma  F
3  Elizabeth  F
4     Minnie  F

14. 先頭からN行を出力<br>
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [ ]:
def row_head(df, n):
  return df.head(n)
row_head(df, 2)

      0  1     2     3
0  Mary  F  7065  1880
1  Anna  F  2604  1880

15. 末尾のN行を出力<br>
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [ ]:
def row_tail(df, n):
  return df.tail(n)
row_tail(df, 2)

          0  1      2     3
2778  Mason  M  12435  2018
2779  Logan  M  12352  2018

16. ファイルをN分割する<br>
自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [ ]:
def row_cut(df, n):
  row_n = int(df.shape[0]/n)
  for i in range(n):
    locals()['df_' + str(i)] = df[i*row_n : (i+1)*row_n]
    print(locals()['df_' + str(i)])
row_cut(df, 2)

              0  1      2     3
0          Mary  F   7065  1880
1          Anna  F   2604  1880
2          Emma  F   2003  1880
3     Elizabeth  F   1939  1880
4        Minnie  F   1746  1880
...         ... ..    ...   ...
1385     Sandra  F  30642  1949
1386      Nancy  F  29246  1949
1387      Carol  F  26783  1949
1388   Kathleen  F  26354  1949
1389     Sharon  F  25711  1949

[1390 rows x 4 columns]
             0  1      2     3
1390     James  M  86857  1949
1391    Robert  M  83872  1949
1392      John  M  81161  1949
1393   William  M  61501  1949
1394   Michael  M  60046  1949
...        ... ..    ...   ...
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

[1390 rows x 4 columns]

17. １列目の文字列の異なり<br>
1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [ ]:
print(len(set(df.iloc[:,0])))

136

18. 以第三列为指标对各行进行降序排序<br>
在不改变每行内容的前提下，按第三列的数值大小对所有行降序排序。使用sort命令确认结果，但程序的运行结果无需与其完全一致。

In [ ]:
df.sort_values(2, ascending=False)

            0  1      2     3
1340    Linda  F  99689  1947
1360    Linda  F  96211  1948
1350    James  M  94757  1947
1550  Michael  M  92704  1957
1351   Robert  M  91640  1947
...       ... ..    ...   ...
27      Annie  F   1326  1881
28     Bertha  F   1324  1881
8      Bertha  F   1320  1880
29      Alice  F   1308  1881
9       Sarah  F   1288  1880

[2780 rows x 4 columns]

19. 降序排列第一列各字符串的出现频率<br>
求各行第一列中每种字符串的出现频率，并按该频率将其降序排列。使用cut, sort 与 uniq 命令确认结果。

In [ ]:
df.iloc[:,0].value_counts()

James      118
William    111
Robert     108
John       108
Mary        92
          ...
Kelly        1
Crystal      1
Walter       1
Carolyn      1
Lori         1
Name: 0, Length: 136, dtype: int64